In [1]:
import pandas as pd

In [6]:
df = pd.read_csv("dataframe_exercicio_modulo_7.csv")
df.head()

,idade,tempo_educacao,estado_civil,cor,sexo,horas_por_semana,salario_anual,nome,dívida
0,39.0,13,Never-married,White,Male,40,<=50K,NaN,NaN
1,50.0,13,Married-civ-spouse,White,Male,13,<=50K,NaN,NaN
2,38.0,9,Divorced,White,Male,40,<=50K,NaN,NaN
3,53.0,7,Married-civ-spouse,Black,Male,40,<=50K,NaN,NaN
4,37.0,14,Married-civ-spouse,White,Female,40,<=50K,NaN,NaN

In [7]:
((df.isnull().sum() / df.shape[0]) * 100).round(2)

idade                 0.34
tempo_educacao        0.00
estado_civil          0.00
cor                   0.00
sexo                  0.00
horas_por_semana      0.00
salario_anual         0.00
nome                100.00
dívida              100.00
dtype: float64

In [8]:
df.isnull().sum()

idade                  99
tempo_educacao          0
estado_civil            0
cor                     0
sexo                    0
horas_por_semana        0
salario_anual           0
nome                29170
dívida              29170
dtype: int64

In [9]:
df.dropna(axis = 1)

,tempo_educacao,estado_civil,cor,sexo,horas_por_semana,salario_anual
0,13,Never-married,White,Male,40,<=50K
1,13,Married-civ-spouse,White,Male,13,<=50K
2,9,Divorced,White,Male,40,<=50K
3,7,Married-civ-spouse,Black,Male,40,<=50K
4,14,Married-civ-spouse,White,Female,40,<=50K
...,...,...,...,...,...,...
29165,12,Married-civ-spouse,White,Female,38,<=50K
29166,9,Married-civ-spouse,White,Male,40,>50K
29167,9,Widowed,White,Female,40,<=50K
29168,9,Never-married,White,Male,20,<=50K
29169,9,Married-civ-spouse,White,Female,40,>50K

In [10]:
df.dropna(axis = 0)

Empty DataFrame
Columns: [idade, tempo_educacao, estado_civil, cor, sexo, horas_por_semana, salario_anual, nome, dívida]
Index: []

In [ ]:
def preprocessamento(df, tempo_educacao, StandardScaler):
    dff = df.copy()
    temp = (df.isnull().sum() / df.shape[0]) >= 0.8
    variaveis_80percFaltantes = temp.loc[temp == True].index.tolist()
    for v in variaveis_80percFaltantes:
        dff = dff.drop(v, axis = 1)
        
    tempo_educacao = list(set(cols_numericas).intersection(set(dff.columns.tolist())))
    StandardScaler = list(set(cols_categoricas).intersection(set(dff.columns.tolist())))
        
    for v in cols_numericas:
        dff[v] = dff[v].fillna(dff[v].mean())
        
    for v in cols_categoricas:
        mode_v = dff[v].value_counts().idxmax()
        dff[v] = dff[v].fillna(mode_v)
    return dff

In [ ]:
dic_variavelSexo = {"masculino":0, "feminino":1}
dic_variavelestado_civil = {"Solteiro":0, "Casado":1}

df_limpo['Sexo_numerico'] = df_limpo.Sexo.map(dic_variavelSexo)
df_limpo['estado_civil_numerico'] = df_limpo.estado_civil.map(dic_variavelestado_civil)

df_limpo

In [ ]:
from sklearn.preprocessing import OneHotEncoder

In [ ]:
ohe = OneHotEncoder()

In [ ]:
ohe.transform(variavel_ohe)

In [ ]:
ohe.transform(variavel_ohe).toarray()

In [ ]:
print("Informações ~ Idade:\n")
print(df_limpo.Idade.describe())

plt.title("Histograma Idade", fontsize = 14, fontweight = 'bold')
plt.hist(df_limpo.Idade)
plt.show()

In [ ]:
dataframe_OHE = pd.DataFrame(ohe.transform(variavel_ohe).toarray(), 
                             columns = ohe.categories_[0].tolist())
dataframe_OHE

In [ ]:
pd.concat([df_limpo, dataframe_OHE], axis = 1)